org/episodes.org
# -*- eval: (load-file "./ubuntu-security-podcast.el") -*-
#+HUGO_SECTION: episode
#+HUGO_BASE_DIR: ../
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
# ensure only a single author is listed, not an array otherwise breaks castinet theme?
# https://github.com/kaushalmodi/ox-hugo/issues/180
#+AUTHOR:
#+HUGO_CUSTOM_FRONT_MATTER: :author "Alex Murray" :explicit no :episode_image img/episode/default.png

* Episode 21
:PROPERTIES:
:EXPORT_FILE_NAME: episode-21
:EXPORT_DATE: 2019-02-21
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :episode_image img/episode/default.png :explicit no :podcast_file USP_E021.mp3 :podcast_duration "17:33" :podcast_bytes "16856841" :permalink "https://ubuntusecuritypodcast.org/episode-21/"
:END:
#+begin_description
Double episode covering the security updates from the last 2 weeks, including snapd (DirtySock), systemd and more, plus we talk responsible disclosure and some open positions on the Ubuntu Security team.
#+end_description
** Overview
Double episode covering the security updates from the last 2 weeks, including snapd (DirtySock), systemd and more, plus we talk responsible disclosure and some open positions on the Ubuntu Security team.
** This week in Ubuntu Security Updates
15 unique CVEs addressed
*** [[[https://usn.ubuntu.com/3886-1/][USN-3886-1]]] poppler vulnerabilities
- 2 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7310][CVE-2019-7310]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-20551][CVE-2018-20551]]
- Two DoS:
  - Out-of-bounds heap buffer read due to missing check for a negative index -> crash -> DoS
  - Crash due to hitting an assertion -> DoS

*** [[[https://usn.ubuntu.com/3888-1/][USN-3888-1]]] GVfs vulnerability
- 1 CVEs addressed in Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3827][CVE-2019-3827]]
- Possible to allow a local user with admin privileges (eg. sudo group) to read arbitrary files without prompting for authorisation IF no policykit agents running
  - Policykit agents run by default so would require user to be running a difffent DE or to have uninstalled / disabled them
  - Also low impact since user has authority anyway

*** [[[https://usn.ubuntu.com/3889-1/][USN-3889-1]]] WebKitGTK+ vulnerabilities
- 2 CVEs addressed in Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6215][CVE-2019-6215]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6212][CVE-2019-6212]]
- Memory corruption and type confusion errors - leading to possible remote code execution

*** [[[https://usn.ubuntu.com/3890-1/][USN-3890-1]]] Django vulnerability
- 1 CVEs addressed in Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6975][CVE-2019-6975]]
- Could cause Django to consume a large amount of memory when formatting a decimal number with a large number of digits or with a large exponent since it would simply print every single provided character
- Possible DoS although would need a very large number to be input
- Fix is to format numbers with more than 200 characters in scientific notation

*** [[[https://usn.ubuntu.com/3887-1/][USN-3887-1]]] snapd vulnerability
- 1 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-7304][CVE-2019-7304]]
- [[https://shenaniganslabs.io/2019/02/13/Dirty-Sock.html]['DirtySock' - discovered by Chris Moberly]]
- Failed to correctly parse and validate the remote socket address
- Code had undergone refactoring and introduced this bug
- Allows to impersonate privileged user and therefore call privileged APIs via the snapd socket

*** [[[https://usn.ubuntu.com/3850-2/][USN-3850-2]]] NSS vulnerabilities
- 3 CVEs addressed in Precise ESM
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12404][CVE-2018-12404]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-12384][CVE-2018-12384]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-0495][CVE-2018-0495]]
- Covered back in [[https://ubuntusecuritypodcast.org/episode-17/][Episode 17]]

*** [[[https://usn.ubuntu.com/3891-1/][USN-3891-1]]] systemd vulnerability
- 1 CVEs addressed in Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6454][CVE-2019-6454]]
- [[https://www.openwall.com/lists/oss-security/2019/02/18/3][Discovered by Ubuntu Security team member Chris Coulson]]
- Stack buffer overflow of DBus path field - declared as VLA, but sender could use a value larger than the stack size and therefore jump the entire stack and the guard pages
- Segmentation violation -> crash -> DoS
  - systemd does not automatically restart so brings down entire system - reboot
- Possible code execution but unlikely
- DBus and systemd need to agree on what the maximum size of various elements are - DBus spec says path could be unlimited - but in practice is less than 32MB! (dbus-daemon limits messages to this size) - systemd now limits path to 64KB AND ensures it keeps running after receiving an invalid sized path

*** [[[https://usn.ubuntu.com/3892-1/][USN-3892-1]]] GDM vulnerability
- 1 CVEs addressed in Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-3825][CVE-2019-3825]]
- Logic error in handing of timed logins (not enabled by default)
- If screen already locked, select to log in as different user - then select a user which has timed login enabled - after timeout will unlock screen of original user
- Need administrator privileges to enabled timed login for a given user so low impact

*** [[[https://usn.ubuntu.com/3866-2/][USN-3866-2]]] Ghostscript regression
- Affecting Trusty, Xenial, Bionic, Cosmic
- Previous update for Ghostscript ([[https://usn.ubuntu.com/3866-1/][USN-3866-1]] - [[https://ubuntusecuritypodcast.org/episode-18/][Episode 18]]) caused a regression in printing 4"x6" (v9.26 - upstream bug)

*** [[[https://usn.ubuntu.com/3893-1/][USN-3893-1]]] Bind vulnerabilities
- 3 CVEs addressed in Trusty, Xenial, Bionic, Cosmic
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2019-6465][CVE-2019-6465]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-5745][CVE-2018-5745]]
  - [[https://people.canonical.com/~ubuntu-security/cve/CVE-2018-5744][CVE-2018-5744]]
- Fail to properly apply controls to zone transfers - could allow clients to request and receive a zone transfer to a dynamically loadable zone contrary to the allow-transfer ACL
- Assertion failure if a trust anchor's keys are replaced with keys using an unsupported algorithm during a key rollover when using the managed-keys feature for DNSSEC validation
- Remotely triggerable memory leak when processing particular packets - DoS

** Goings on in Ubuntu Security Community
*** snapd, systemd and handling of embargoed issues
- 2 updates involving close communication between Ubuntu Security Team and external stakeholders - embargoed
- Responsible Disclosure - allows to coordinate a fix in a timely manner and then release update once all parties are ready in a coordinated manner
- Set CRD with stakeholders (reporter, upstream, other distros etc)
- Coordinate fix with upstream and other distros
- Plan coordinated updates to be released with other distros / upstream at CRD

*** Hiring
**** Ubuntu Security Generalist
- https://boards.greenhouse.io/canonical/jobs/1548812
**** Robotics Security Engineer
- https://boards.greenhouse.io/canonical/jobs/1550997
**** Security Automation Engineer
- https://boards.greenhouse.io/canonical/jobs/1548632

** Get in contact
# Feel free to send us questions and we will answer in future episodes
- [[mailto:security@ubuntu.com][security@ubuntu.com]]
- [[http://webchat.freenode.net?channels=%2523ubuntu-hardened&uio=d4][#ubuntu-hardended on the Freenode IRC network]]
- [[https://twitter.com/ubuntu_sec][@ubuntu_sec on twitter]]
